workspace/InformationRegisters/АукРасчетИтоговПараметры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукРасчетИтоговПараметры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукРасчетИтоговПараметры/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписи(пМассивСтруктур) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМассивСтруктур, "АукРасчетИтоговПараметры"); 
	
	Если Не сткРез.Успех Тогда	
		ВызватьИсключение сткРез.Ошибка;		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьДанныеДляЗаписи(пСткПараметры) Экспорт
	масРезультат = Новый Массив;
	
	Для Каждого сткПараметрыАукциона Из пСткПараметры.ПараметрыАукциона Цикл
		сткЗапись = Новый Структура;
		
		сткЗапись.Вставить("Аукцион",		пСткПараметры.Аукцион);
		сткЗапись.Вставить("НомерЭтапа",	пСткПараметры.НомерЭтапа);
		сткЗапись.Вставить("Параметр",		сткПараметрыАукциона.Параметр);
		сткЗапись.Вставить("Значение",		сткПараметрыАукциона.Значение);
		сткЗапись.Вставить("Автор",			пСткПараметры.Автор);
		сткЗапись.Вставить("ДатаЗаписи",	пСткПараметры.ТекДата);
		
		масРезультат.Добавить(сткЗапись);
	КонецЦикла;	
	
	Возврат масРезультат;
КонецФункции

Функция СохраненныеЗначенияПараметровИтоговАукционаПоЭтапу(пАукцион, пНомерЭтапа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговПараметры.Параметр КАК Параметр,
	|	АукРасчетИтоговПараметры.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговПараметры КАК АукРасчетИтоговПараметры
	|ГДЕ
	|	АукРасчетИтоговПараметры.Аукцион = &Аукцион
	|	И АукРасчетИтоговПараметры.НомерЭтапа = &НомерЭтапа";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа",	пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат Неопределено;	
	//Иначе
		Возврат ЭдоОбщийСервер.РезультатЗапросаВСоответствие(РезультатЗапроса, "Параметр", "Значение");
	//КонецЕсли;	
КонецФункции	

#КонецОбласти
